---
kind: enumMember
id: F:Autodesk.Revit.DB.PreviewFamilyVisibilityMode.On
enum: Autodesk.Revit.DB.PreviewFamilyVisibilityMode
source: html/efc5a721-5885-f63e-64af-83e0c93e6c45.htm
---
# Autodesk.Revit.DB.PreviewFamilyVisibilityMode.On

Element Visibility of a view is applied to show visible elements only.
 Elements that are cut by a reference plane will be shown with their respective cut geometry.